In [1]:
import pandas as pd
import numpy as np

In [3]:
exam_data = {'name': ['Anjum', 'Anali', 'Souria', 'Rockea', 'Imani', 'Mouliya', 'Julie', 'Rana', 'Kavin', 'Bosia'],
'score': [15.5, 9, 16.5, np.nan, 9, 30, 17.5, np.nan, 8, 20],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J']

For the data set given below construct the DataFrame object

In [4]:
data = pd.DataFrame(exam_data, index = labels)
print(data)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

Get the first four rows of a DataFrame using indexing method

In [5]:
print(data.iloc[:4])

     name  score  attempts qualify
A   Anjum   15.5         1     yes
B   Anali    9.0         3      no
C  Souria   16.5         2     yes
D  Rockea    NaN         3      no

In [6]:
print(data)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

Select the columns 'score' and 'attempts' in rows 1, 3, 5, 7

In [7]:
data.iloc[[1,3,5,7],[1,2]]

   score  attempts
B    9.0         3
D    NaN         3
F   30.0         3
H    NaN         1

Count the number of rows and columns without shape attribute

In [9]:
data.axes[0]

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'J'], dtype='object')

In [10]:
data.axes[1]

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

In [11]:
print('The number of rows:', len(data.axes[0]))
print('The number of rows:', len(data.axes[1]))

The number of rows: 10
The number of rows: 4

Select the rows where the score is between 16 and 20

In [14]:
print(data)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

In [16]:
selection = data['score'].between(16, 20)
selection

A    False
B    False
C     True
D    False
E    False
F    False
G     True
H    False
I    False
J     True
Name: score, dtype: bool

In [17]:
print(data[selection])

     name  score  attempts qualify
C  Souria   16.5         2     yes
G   Julie   17.5         1     yes
J   Bosia   20.0         1     yes

Select the rows where number of attempts in the examination is less than 2 and score is greater than 16

In [18]:
print(data)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

In [19]:
(data['attempts'] < 2)

A     True
B    False
C    False
D    False
E    False
F    False
G     True
H     True
I    False
J     True
Name: attempts, dtype: bool

In [23]:
(data['score'] > 16)

A    False
B    False
C     True
D    False
E    False
F     True
G     True
H    False
I    False
J     True
Name: score, dtype: bool

In [24]:
condition =  (data['attempts'] < 2) & (data['score'] > 16)

In [25]:
print(data[condition])

    name  score  attempts qualify
G  Julie   17.5         1     yes
J  Bosia   20.0         1     yes

For the DataFrame created ;
1. Change the score of rows 'C' and 'I' to 16
2. Calculate the sum of the examination attempts by the students
3. Add new row with the details name: 'Rupali', score: 16, attempts: 2, qualify: 'yes', label: 'L'. After adding the new row display it and remove it to maintain
the original DataFrame.
4. Remove the last 4 rows and save it as a new DataFrame.

In [26]:
print(data)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.5         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin    8.0         2      no
J    Bosia   20.0         1     yes

In [27]:
data.loc[['C', 'I'], 'score'] = 16
data

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin   16.0         2      no
J    Bosia   20.0         1     yes

In [28]:
print(data)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin   16.0         2      no
J    Bosia   20.0         1     yes

In [29]:
print(data['attempts'].sum())

19

In [30]:
data.loc['L'] = ['Rupali', 16, 2, 'yes']
data

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin   16.0         2      no
J    Bosia   20.0         1     yes
L   Rupali   16.0         2     yes

In [31]:
data_new = data.iloc[: -1, :]
data_new

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin   16.0         2      no
J    Bosia   20.0         1     yes

In [32]:
data.drop('L', inplace=True)

In [33]:
print(data)

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes
G    Julie   17.5         1     yes
H     Rana    NaN         1      no
I    Kavin   16.0         2      no
J    Bosia   20.0         1     yes

In [34]:
# we can use -4 index to remove the last 4 raws inside the iloc

In [35]:
new_data2 = data.iloc[: -4]
new_data2

      name  score  attempts qualify
A    Anjum   15.5         1     yes
B    Anali    9.0         3      no
C   Souria   16.0         2     yes
D   Rockea    NaN         3      no
E    Imani    9.0         2      no
F  Mouliya   30.0         3     yes